; domain
(define (domain maze)
(:predicates
	 (at ?p ?t) (person ?p) (empty ?x) (wall ?x) (north ?a ?b) (south ?a ?b) (west ?a ?b) (east ?a ?b))

(:action move-north
 :parameters ( ?p ?a ?b)
 :precondition
	(and (person ?p) (empty ?b) (at ?p ?a)  (north ?a ?b))
 :effect
	(and (at ?p ?b) (not (at ?p ?a))))
(:action move-south
 :parameters ( ?p ?a ?b)
 :precondition
	(and (person ?p) (empty ?b) (at ?p ?a)  (south ?a ?b))
 :effect
	(and (at ?p ?b) (not (at ?p ?a))))
(:action move-west
 :parameters ( ?p ?a ?b)
 :precondition
	(and (person ?p) (empty ?b) (at ?p ?a)  (west ?a ?b))
 :effect
	(and (at ?p ?b) (not (at ?p ?a))))
(:action move-east
 :parameters ( ?p ?a ?b)
 :precondition
	(and (person ?p) (empty ?b) (at ?p ?a)  (east ?a ?b))
 :effect
	(and (at ?p ?b) (not (at ?p ?a))))


)

; problem
(define (problem simple_maze)
    (:domain  maze)
    (:objects
        person1
	goal_tile
	t4
	t2
	t3
	t0
	start_tile
	person1
	t1)
(:init
	(west t2 t1)
	(west t4 t3)
	(west t3 t2)
	(west t0 start_tile)
	(west goal_tile t4)
	(west t1 t0)
	(person person1)
	(at person1 start_tile)
	(east t1 t2)
	(east start_tile t0)
	(east t2 t3)
	(east t0 t1)
	(east t3 t4)
	(east t4 goal_tile)
	(empty t1)
	(empty goal_tile)
	(empty t0)
	(empty t4)
	(empty t2)
	(empty start_tile)
	(empty t3)        
            )
    (:goal 
        (and (at person1 goal_tile))
        )
    )

; plan
1. (move-east person1 start_tile t0)
   deleted: (at person1 start_tile)
   added: (at person1 t0)
   goals met: 0 of 1
2. (move-east person1 t0 t1)
   deleted: (at person1 t0)
   added: (at person1 t1)
   goals met: 0 of 1
3. (move-east person1 t1 t2)
   deleted: (at person1 t1)
   added: (at person1 t2)
   goals met: 0 of 1
4. (move-east person1 t2 t3)
   deleted: (at person1 t2)
   added: (at person1 t3)
   goals met: 0 of 1
5. (move-east person1 t3 t4)
   deleted: (at person1 t3)
   added: (at person1 t4)
   goals met: 0 of 1
6. (move-east person1 t4 goal_tile)
   deleted: (at person1 t4)
   added: (at person1 goal_tile)
   goals met: 1 of 1
